# HasResolutions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinition..::..HasResolutions Method
FailureDefinition Class See Also
---
Checks if the FailureDefinition has at least one resolution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasResolutions()
```

Visual Basic
---
```text
Public Function HasResolutions As Boolean
```

Visual C++
---
```text
public:
bool HasResolutions()
```

# ### Return Value
True if at least one resolution is defined in the FailureDefinition.
# See Also
FailureDefinition Class
Autodesk.Revit.DB Namespace